In [7]:
import pandas as pd

In [15]:
friends = [{'name': 'Jone', 'age': 20, 'job': 'student'},
           {'name': 'Jenny', 'age': 30, 'job': None},
           {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friends)
df = df[['name','age','job']] # 이미 위 자료에 들어있는 정보

In [16]:
df

    name  age      job
0   Jone   20  student
1  Jenny   30     None
2   Nate   30  teacher